/**
  ******************************************************************************
  * 文件名称：tea.c
  * 功    能：TEA加解密
  * 作    者：一直在跑灯
  * 日    期：2016/12/28
  ******************************************************************************
  */
#include "tea.h"


/* delta为一常数 */
//static const uint32_t delta = 0x9E3779B9;


/**
  ******************************************************************************
  * 函数名称 ：TEA_Encipher()
  * 函数功能 ：TEA加密，每次只能加密8字节数据
  * 入口参数 ：crypt ：加密后的数据（8字节密文）
  *            plain ：待加密的数据（8字节明文）
  *            key ：用户密码，固定为16字节，不足16字节需要补齐
  * 返 回 值 ：无
  ******************************************************************************
  */
void TEA_Encipher(uint32_t *crypt, uint32_t *plain, uint32_t *key)
{
	uint32_t y = plain[0], z = plain[1];	// 明文输入被分为左右两部分
	uint32_t a = key[0], b = key[1], c = key[2], d = key[3];	// 密钥分为四部分暂存到四个变量
  uint32_t delta = 0x9e3779b9;    // delta为一常数
	uint32_t sum = 0;
	uint8_t n = 32;	// n表示加密轮数，推荐32

	/* TEA加密 */
	while (n-- > 0)
	{
		sum += delta;
		y += (z << 4) + a^z + sum^(z >> 5) + b;
		z += (y << 4) + c^y + sum^(y >> 5) + d;
	}

	/* 保存密文 */
	crypt[0] = y;
	crypt[1] = z;
}


/**
  ******************************************************************************
  * 函数名称 ：TEA_Decrypt()
  * 函数功能 ：TEA解密，每次只能解密8字节数据
  * 入口参数 ：crypt ：已加密的数据，调用函数后数据会被解密并保存在crypt
  *            key ：用户密码，固定为16字节，不足16字节需要补齐
  * 返 回 值 ：无
  ******************************************************************************
  */
void TEA_Decrypt(uint32_t * crypt,  uint32_t * key)
{
	uint32_t y = crypt[0], z = crypt[1];
  uint32_t delta = 0x9E3779B9;    // delta为一常数
	uint32_t sum = 0xC6EF3720;    //等于delta << 5 , 对应32轮运算，
	uint32_t a = key[0], b = key[1], c = key[2], d = key[3];	// 密钥分为四部分暂存到四个变量
	uint8_t i;

	/* TEA解密 */
	for (i = 0; i < 32; i++)
	{
    z -= (y << 4) + c^y + sum^(y >> 5) + d;
    y -= (z << 4) + a^z + sum^(z >> 5) + b;
		sum -= delta;
	}

	/* 密文变明文 */
	crypt[0] = y;
	crypt[1] = z;
}
